{"disqus": {"path": "/blog/2008/12/7/free-subversion-repositories-for-your-projects/","commentCount":13,"comments":[{"postId":"6443B5340947F8","parentPostId":"null","date":"2008-12-07","author":"Erik Giberti","avatar":"","message":"I think Google code limits you to 10 repositories. I may be remembering incorrectly here, but they must be Open Source projects as well.","replies":"[]"},{"postId":"DF7D4CF82907F0","parentPostId":"null","date":"2008-12-07","author":"TJ Downes","avatar":"","message":"Erik is correct, Google Code is open source projects only.\n\nOpen SVN is a nightmare. The first indicator is that their SSL certificate does not match their domain. They've incorrectly tried to configure it as a wildcard certificate. The second clue is the big warning on the homepage about losing two weeks worth of repository data. Why would I host my project at a location that loses two weeks worth of version data?\n\nMy suggestion on version control has always been to host your own. It's free and you have complete control over your repo. Since version control systems typically require very few resources an older box with mirrored disks and good nightly backups is very inexpensive to build there is very little reason to choose an external host.","replies":"[]"},{"postId":"10DDDF1092B490","parentPostId":"null","date":"2008-12-07","author":"Dan Vega","avatar":"","message":"What about RiaForge (www.riaforge.org)? It is the best place to go to find CF,Flex &amp; AIR open source projects. You also have free svn hosting with your project","replies":"[]"},{"postId":"3EE9C58A3C5571","parentPostId":"null","date":"2008-12-07","author":"Akbarsait","avatar":"","message":"@Erik Giberti Thanks for the information.\n\n@TJ Downes Yes I agree with you on the OpenSVN but it's up to the users who wish to choose the best for SVN repositories for there projects. Own hosting is very safe and we have full control but the free repositories might be useful for people who don't have any own hosting with them. Thanks for you ideas.\n\n@Dan Vega - RIAForge is great for Open source projects but to host our own projects we need to go for paid svn options or these free svn repositories in the web.","replies":"[]"},{"postId":"B3567213DB6CC0","parentPostId":"null","date":"2008-12-08","author":"Charlie Arehart","avatar":"","message":"Thanks for sharing, Akbarsait. For what it's worth to your readers, I have links to a few more, as well as also links to some reviews of them, as a category within my CF411 site:\n\nRemote Source Code Repositories\nhttp://www.cf411.com/#scc-repositories\n\nThis is one of several hundred categories of tools and resources of interest to CFers. I didn't have a couple mentioned here and have added them. Again, thanks.","replies":"[]"},{"postId":"530D064E08E789","parentPostId":"null","date":"2008-12-08","author":"Nolan Erck","avatar":"","message":"I've used Unfuddle for various projects (both paid and free accounts) and have been very happy with them.  Quick answers when I need support, great control panel tools to manage my projects, etc.\n\nDisclaimer: I co-manage the Sacramento CF User Group, and Unfuddle has provided us with a sponsored account for the group, but the reason we asked them was based on my positive experience with Unfuddle on previous projects.  I'd say these things even if they weren't helping out my group. :)","replies":"[]"},{"postId":"A5E6CA4A68571A","parentPostId":"null","date":"2008-12-08","author":"Akbarsait","avatar":"","message":"@Charlie Thanks for the information and I have updated my post with the link for Source code repositories at CF411.com\n\n@Nolan Erck Thanks for sharing your experience with Unfuddle :-)","replies":"[]"},{"postId":"0D356946959A51","parentPostId":"null","date":"2009-01-07","author":"Sylvia","avatar":"","message":"I've just tried unfuddle out and was very pleased with it. The SSL-Support is the only thing missing. But in total there service is great.\n\nDoes somebody know the name of the dashboard application they use?","replies":"[]"},{"postId":"CF1A8B522655BE","parentPostId":"null","date":"2009-01-15","author":"zamu","avatar":"","message":"Hi!, XP-Dev have an web form to import/export an SVN-repository. Unfuddle seems to be more friendly, but to do the import/export action, i have to contact they.\n\n&quot;If you have an existing Subversion repository which you would like to move to Unfuddle, simply make a dump (svnadmin dump) and contact us&quot;.","replies":"[]"},{"postId":"87CEF3C23339AA","parentPostId":"null","date":"2009-02-03","author":"Paul Kukiel","avatar":"","message":"XPDEV is now upto 1500mb space, Unlimited repos and users :)\n\nI was also recently shown: http://beanstalkapp.com/ I haven't tried it yet.","replies":"[]"},{"postId":"0C03E1940BDC75","parentPostId":"null","date":"2010-10-21","author":"desireed","avatar":"","message":"Assembla offers free unlimited users and unlimited repos also for private projects\n\nhttp://offers.assembla.com/free-subversion-hosting/","replies":"[]"},{"postId":"8845A1C0E38F69","parentPostId":"null","date":"2012-01-05","author":"Matt","avatar":"","message":"Check out http://www.assembla.com. They offer free private repos with unlimited users and 1GB storage. You can upgrade your free repo to include ticket, collaboration, and project management tools.\n\nAlso, with the semi-recent release of Subversion 1.7, make sure to update to a Subversion 1.7 supported client to take advantage of the performance benefits and client side improvements. Here is a resource for free downloads of Subversion 1.7 compatible svn clients: http://svn-ref.assembla.com/download-clients.html.","replies":"[]"},{"postId":"950669A7249F94","parentPostId":"null","date":"2012-01-05","author":"Matt","avatar":"","message":"Check out http://www.assembla.com. They offer free private repos with unlimited users and 1GB storage. You can upgrade your free repo to include ticket, collaboration, and project management tools.\n\nAlso, with the semi-recent release of Subversion 1.7, make sure to update to a Subversion 1.7 supported client to take advantage of the performance benefits and client side improvements. Here is a resource for free downloads of Subversion 1.7 compatible svn clients: http://svn-ref.assembla.com/download-clients.html.","replies":"[]"}]}}