{"disqus": {"path": "/blog/2008/11/18/post-your-favorite-flex-3-feature-and-win-a-flex-3-book/","commentCount":8,"comments":[{"postId":"6D5D0835B0A16F","parentPostId":"null","date":"2008-11-18","author":"Matt Gifford","avatar":"","message":"Flex has so many fantastic new features.\n\nSkinning and CSS control - Rich Internet Applications should have a sleek look and feel, and more importantly, individuality.\nAdvanced data retrieval and sorting - the advanced data grid, remote objects, OLAP..\n\nso much to choose from. Flex 3 really is a fantastic development environment, and one which I am enjoying learning.","replies":"[]"},{"postId":"2E7711BA11F163","parentPostId":"null","date":"2008-11-18","author":"Jens","avatar":"","message":"I have to say that localization is the best feature of Flex 3. Why? Because so many more can enjoy my applications!","replies":"[]"},{"postId":"4F8C1B77B56F61","parentPostId":"null","date":"2008-11-18","author":"James L.","avatar":"","message":"GUI Animation was one of the important features that many website have been lack of excitement for years, when I replace some of the features with Flex applications, our user could find themselves benefits from a new web experience. Total user experience is the key point to the user satisfactions.\n\nFlex is...as fun as roller coaster experience, something never happen in other development!","replies":"[]"},{"postId":"8C979BC5AD5D1C","parentPostId":"null","date":"2008-11-18","author":"Raul Riera","avatar":"","message":"For me the best thiing about Flex is how easy Adobe made it possible to create Flash Applications, now we have the tools to take away that awful undeserved name of &quot;skip-intro&quot; applications.","replies":"[]"},{"postId":"0F0DB1023CE4B3","parentPostId":"null","date":"2008-11-19","author":"Sree Kiran","avatar":"","message":"The most significant feature of Flex is customization bcoz instead of just using what is available,u can actually make it look &amp; behave the way u always wanted.Not to forget the custom effects &amp; animation &amp; the reusability of these components.\nOfcourse Flex is a bundle of useful features.","replies":"[]"},{"postId":"184C2C86D26311","parentPostId":"null","date":"2008-11-19","author":"saumya","avatar":"","message":"Preloader for the application\nI think its the most useful but freely available so ignored at the first place.\nA free preloader, I can customise,if I like to, is a must have.","replies":"[]"},{"postId":"DD1685A67E949E","parentPostId":"null","date":"2008-11-22","author":"Felix","avatar":"","message":"I love the features like Skinning and applying styles. The feature of importing skins created using CS3 are awesome!","replies":"[]"},{"postId":"4D4B3045834350","parentPostId":"null","date":"2008-11-22","author":"Sundar","avatar":"","message":"Charting components, interacting with charts and chart appearance implementation using styles are good stuffs in Flex.","replies":"[]"}]}}
