{"disqus": {"path": "/blog/2013/8/29/a-new-cfml-weekly-newsletter-for-you/","commentCount":4,"comments":[{"postId":"5237F5E000A7A0","parentPostId":"null","date":"2013-08-30","author":"AdamTuttle","avatar":"","message":"Did you offer to help Pete source content for his newsletter? It seems like this sort of thing would benefit from collaboration, not fragmentation...","replies":"[]"},{"postId":"28B8AF6C10C222","parentPostId":"null","date":"2013-08-30","author":"akbarsait","avatar":"","message":"@Adam completely agree with your points. I don't have any second thought on that front but I have started this to make available as a new one without disturbing the existing. This will help each of us to give a regular weekly news from both of the newsletters in a unique way to our CFML community every week. If one misses then other will hit your mailbox for sure. \r\n\r\nI have the first issues released to 40+ subscribers as of now. I welcome our community members to get benefit out of it.","replies":"[]"},{"postId":"760BC2489A757D","parentPostId":"null","date":"2013-09-03","author":"AdamTuttle","avatar":"","message":"You say that you agree, but I don't think you do.\r\n\r\nThis is not a medium that benefits from competition. This is fragmentation, and it will serve to continue to fragment the community. We need to rally behind a few good things and support them, rather than re-inventing the wheel every week.\r\n\r\nI would encourage you to reach out to Pete and offer your help. We don't know, he might be happy to give you complete control over the newsletter. If not that, then I bet he'd welcome help aggregating content to include. Then you won't have to go through the work of reaching his existing subscribers. If you need help getting in touch with Pete, you have my email address via this comment and I'd be happy to make the introduction for you.\r\n\r\n&quot;This will help each of us to give a regular weekly news from both of the newsletters in a unique way to our CFML community every week. If one misses then other will hit your mailbox for sure.&quot;\r\n\r\n-- this shows a fundamental misunderstanding of how these types of newsletters are beneficial and why people subscribe to them. I don't sign up for 6 different weekly emails about HTML5, I want one. I get ONE javascript newsletter. ONE devops newsletter. More is not better. The primary benefit is that I don't have to go to multiple sources. Otherwise, how is it an improvement over RSS?","replies":"[]"},{"postId":"594676E5416814","parentPostId":"null","date":"2013-09-03","author":"akbarsait","avatar":"","message":"I know Pete and I have contacted him 4 months before for providing contribution to CFML Weekly but it was not happened due to some other reasons. Even before I started this weekly, I emailed and informed him that i need his support for this new CFML weekly.  As you said I'll be very happy to include if he wants to aggregate content to this new weekly. \r\n\r\nI strongly disagree with the word fragmentation I'm playing with the launch of this CFML weekly.  I'm doing this initiative with my own interest and want to server the newsletter in a unique way to the community.  As you said if one weekly is missed for a week then it will be better to check the other one for news. It's an alternate for the exiting weekly not the fragmentation of the community.","replies":"[]"}]}}
